# SetVertSecCPByStyle

## Description
```pascal
FUNCTION SetVertSecCPByStyle(
				hObject : HANDLE;
				byStyle : BOOLEAN) : BOOLEAN;
```

```python

def vs.SetVertSecCPByStyle(hObject, byStyle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|byStyle|BOOLEAN||

## Version
Availability: from Vectorworks 2020
## Category
* Objects - Custom